Repository: smile00112/wc_iiko_exchange
Catalog: languages/skyweb-wc-iiko-*.po
Languages: ru_ru

source: Settings
ru_ru: Настройки

source: Plugin page
ru_ru: Страница плагина

source: IikoCloud needs WooCommerce to run. Please, install and active WooCommerce plugin.
ru_ru: Для работы iikoCloud требуется WooCommerce. Пожалуйста, установите и активируйте плагин WooCommerce.

source: iiko group ID
ru_ru: iiko ID группы

source: Uniqe iiko group ID for the product category.
ru_ru: Уникальный ID группы iiko для категории товаров.

source: iiko product ID
ru_ru: iiko ID продукта

source: Uniqe iiko product ID.
ru_ru: Уникальный ID продукта iiko.

source: Export order to iiko
ru_ru: Экспорт заказа в iiko

source: Check created delivery from iiko
ru_ru: Проверить созданную доставку в айко

source: IikoCloud Control Panel %sv%s%s
ru_ru: Панель управления iikoCloud %sv%s%s

source: %sSettings%s
ru_ru: %sНастройки%s

source: General information
ru_ru: Основная информация

source: Organizations, terminals, categories and products from iiko.
ru_ru: Организации, терминалы, категории и продукты из iiko.

source: 1. Get Organizations
ru_ru: 1. Получить организации

source: Organization:
ru_ru: Организации:

source: 2. Get Terminals
ru_ru: 2. Получить терминалы

source: Available Terminals:
ru_ru: Доступные терминалы:

source: 3. Get Nomenclature
ru_ru: 3. Получить номенклатуру

source: And save chosen organization and terminal to the plugin settings.
ru_ru: И сохранить выбранную организацию и терминал в настройки.

source: Nomenclature general info:
ru_ru: Основная информация номенклатуры:

source: Groups:
ru_ru: Группы:

source: Product Categories:
ru_ru: Категории продуктов:

source: Products
ru_ru: Продукты

source: Dishes:
ru_ru: Блюда:

source: Goods:
ru_ru: Товары:

source: Modifiers:
ru_ru: Модификаторы:

source: Sizes:
ru_ru: Размеры:

source: Revision:
ru_ru: Ревизия:

source: Import
ru_ru: Импорт

source: Categories and products to WooCommerce.
ru_ru: Категории и продукты в WooCommerce.

source: Get the information from iiko first.
ru_ru: Сначала получите информацию из iiko.

source: Use CTRL + click to select several groups in the list.
ru_ru: Используйте CTRL + щелчок мышью, чтобы выбрать несколько групп в списке.

source: Strikethrough groups are deleted groups.
ru_ru: Зачеркнутые группы - это удаленные группы.

source: Groups highlighted in green are modifiers.
ru_ru: Группы, выделенные зеленым цветом, являются модификаторами.

source: 4. Import selected groups and products
ru_ru: 4. Импортировать выбранные группы и продукты

source: Imported nomenclature info:
ru_ru: Информация об импортированной номенклатуре:

source: Products:
ru_ru: Продукты:

source: Additional information
ru_ru: Дополнительная информация

source: Cities, streets and payment methods from iiko to prepare the export of orders from WooCommerce to iiko.
ru_ru: Города, улицы и способы оплаты из iiko для подготовки экспорта заказов из WooCommerce в iiko.

source: Get Cities
ru_ru: Получить города

source: Cities:
ru_ru: Города:

source: Get Streets
ru_ru: Получить улицы

source: And save chosen city and streets to the plugin settings.
ru_ru: И сохранить выбранный город и улицы в настройки.

source: Get Payment Types
ru_ru: Получить типы оплат

source: Terminal:
ru_ru: Терминал:

source: Clear
ru_ru: Очистить

source: General
ru_ru: Главное

source: Export
ru_ru: Экспорт

source: Some of these settings are updated automatically on %splugin page%s.
ru_ru: Некоторые из этих настроек обновляются автоматически на %sстранице плагина%s.

source: Organization
ru_ru: Организация

source: Organization ID - %s%s%s
ru_ru: ID организации - %s%s%s

source: Updated automatically when you press 'Get Nomenclature' button.
ru_ru: Обновляется автоматически при нажатии кнопки 'Получить номенклатуру'.

source: Terminal
ru_ru: Терминал

source: Terminal ID - %s%s%s
ru_ru: ID терминала - %s%s%s

source: Nomenclature revision
ru_ru: Ревизия номенклатуры

source: Chosen group(s)
ru_ru: Выбранные группы

source: Groups that you imported last time and which will be exported using CRON.
ru_ru: Группы, которые вы импортировали последний раз и которые будут экспортированы используя CRON.

source: Download images
ru_ru: Загружать изображения

source: Download groups/categories and dishes/products images from iiko
ru_ru: Загружать изображения групп/категорий товаров и блюд/товары из iiko

source: City
ru_ru: Город

source: City ID - %s%s%s
ru_ru: ID города - %s%s%s

source: Updated automatically when you press 'Get Streets' button.
ru_ru: Обновляется автоматически при нажатии кнопки 'Получить улицы'.

source: Streets amount
ru_ru: Количество улиц

source: Streets amount retrieved from iiko.
ru_ru: Количество улиц, полученное из iiko.

source: Default street
ru_ru: Улица по-умолчанию

source: The exact name of the default street in iiko.
ru_ru: Точное название улицы по-умолчанию в iiko.

source: IikoCloud API Settings
ru_ru: Настройки API iikoCloud

source: API Login
ru_ru: Логин API

source: Unique identifier of the store, issued by the iiko. %sSee documentation%s or contact your personal manager for more details.
ru_ru: Уникальный идентификатор магазина, выданный iiko. %sПодробнее в документации%s или у вашего персонального менеджера iiko.

source: If the apiLogin field is empty, then the plugin will not work.
ru_ru: Если поле apiLogin пусто, то плагин работать не будет.

source: Timeout in seconds
ru_ru: Таймаут в секундах

source: Time limit for API requests.
ru_ru: Лимит времени для запросов API.

source: Debug mode
ru_ru: Режим отладки

source: Turn on debug mode
ru_ru: Включить режим отладки

source: See logs in %sWooCommerce > System Status > Logs%s.
ru_ru: Смотрите логи в %sWooCommerce > Статус > Журналы%s.

source: Size
ru_ru: Размер

source: Modifier
ru_ru: Модификатор

source: Please select a street from the options provided.
ru_ru: Пожалуйста, выберите улицу из предоставленных вариантов.

source: If you are sure that there is no such street in the list, then write your own version.
ru_ru: Если нужной улицы в списке нет, напишите свой вариант.

source: Time
ru_ru: Время

source: As soon as possible
ru_ru: Как можно скорее

source: By the time
ru_ru: Ко времени

source: Date
ru_ru: Дата

source: Delivery Method
ru_ru: Метод доставки

source: Phone number must be at least <strong>11 digits</strong>.
ru_ru: Номер телефона должен содержать минимум <strong>11 цифр</strong>.

source: Checkout
ru_ru: Оформление заказа

source: Checkout Fields
ru_ru: Поля оформления заказа

source: Additional fields and features for WooCommerce checkout page.
ru_ru: Дополнительные поля и функции для страницы оформления заказа WooCommerce.

source: "Phone" field
ru_ru: Поле "Телефон"

source: Use billing phone mask on checkout page
ru_ru: Использовать маску телефона на странице оформления заказа

source: Format
ru_ru: Формат

source: Use zeros for arbitrary values and numbers for predefined values. %sRead more%s.
ru_ru: Используйте нули для произвольных значений и числа для предопределенных значений. %sПодробнее%s.

source: "Address" field
ru_ru: Поле "Адрес"

source: Make not required and hide address fields for local pickup
ru_ru: Сделать необязательным и скрыть поля адреса для Самовывоза

source: Fields IDs
ru_ru: ID полей

source: Use ID fields separated by commas. For example '#billing_country_field, #billing_city_field, #billing_postcode_field'.
ru_ru: Используйте ID разделенные запятыми. Например, '#billing_country_field, #billing_city_field, #billing_postcode_field'.

source: "Complete before" field
ru_ru: Поле "Завершить до"

source: Show complete before field on checkout page
ru_ru: Отображать поле 'Завершить до' на странице оформления заказа

source: Position
ru_ru: Позиция

source: Action tag for output the field. Default value is 'woocommerce_checkout_after_customer_details'.
ru_ru: Тег экшена для вывода поля. Значение по умолчанию 'woocommerce_checkout_after_customer_details'.

source: Start time
ru_ru: Начало рабочего дня

source: Default value is '11'.
ru_ru: Значение по-умолчанию '11'.

source: End time
ru_ru: Конец рабочего дня

source: Default value is '23'.
ru_ru: Значение по-умолчанию '23'.

source: Every 15 minutes
ru_ru: Каждые 15 минут

source: Every 30 minutes
ru_ru: Каждые 30 минут

source: Every 2 hours
ru_ru: Каждые 2 часа

source: Every 4 hours
ru_ru: Каждые 4 часа

source: Every 6 hours
ru_ru: Каждые 6 часов

source: Every 8 hours
ru_ru: Каждые 8 часов

source: Every 10 hours
ru_ru: Каждые 10 часов

source: Last CRON job error.
ru_ru: Ошибка последнего задания CRON.

source: There are not groups for import.
ru_ru: Нет групп для импорта.

source: Please turn on debug mode and check logs.
ru_ru: Включите режим отладки и проверьте логи.

source: Auto import
ru_ru: Авто импорт

source: Nomenclature
ru_ru: Номенклатура

source: Import nomenclature automatically
ru_ru: Импортировать номенклатуру автоматически

source: Recurrence
ru_ru: Повторение

source: Default value is 'Once Hourly'.
ru_ru: Значение по-умолчанию 'Каждый час'.

source: How often the import should subsequently recur.
ru_ru: Как часто должен повторяться импорт.

source: Once Hourly
ru_ru: Каждый час

source: Twice Daily
ru_ru: Дважды в день

source: Once Daily
ru_ru: Раз в день

source: Once Weekly
ru_ru: Раз в неделю

source: Check revision
ru_ru: Проверять ревизию

source: Use local and remote revisions to compare nomenclature
ru_ru: Использовать локальную и удаленную ревизии для сравнения номенклатуры

source: Auto import will work only if remote nomenclature revision is greater than local.
ru_ru: Автоматический импорт будет работать только в том случае, если удаленная версия номенклатуры выше локальной.

source: Iiko delivery creation error. Order %s
ru_ru: Ошибка создания доставки в iiko. Заказ %s

source: Turn on debug mode in plugin settings and see WooCommerce logs.
ru_ru: Включите режим отладки в настройках плагина и посмотрите логи WooCommerce.

source: Iiko transfer error. Order %s
ru_ru: Ошибка передачи в iiko. Заказ %s

source: Iiko transfer error.
ru_ru: Ошибка передачи в iiko.

source: Iiko delivery creation response is empty. Order %s
ru_ru: Пустой ответ iiko на создание доставки. Заказ %s

source: Iiko delivery creation response is empty.
ru_ru: Пустой ответ iiko на создание доставки.

source: Transferred to iiko.
ru_ru: Передано в iiko.

source: Iiko delivery creation error. Code 200.
ru_ru: Ошибка создания доставки в iiko. Код 200.

source: Iiko delivery creation error. Codes 400, 401, 408 or 500.
ru_ru: Ошибка создания доставки в iiko. Коды 400, 401, 408 или 500.

source: Payments
ru_ru: Методы оплаты

source: Payment Methods
ru_ru: Методы оплаты

source: Updated automatically when you press 'Get Payment Methods' button on %splugin page%s.
ru_ru: Обновляется автоматически при нажатии кнопки 'Получить методы оплаты' на %sстранице плагина%s.

source: WooCommerce payment method code for %1$s%2$s%3$s iiko payment type.
ru_ru: Код метода оплаты WooCommerce для типа оплаты iiko - %1$s%2$s%3$s.

source: Please enter the appropriate WooCommerce payment method code.
ru_ru: Пожалуйста, введите соответствующий код способа оплаты WooCommerce.

source: Processed externally (by external payment system)
ru_ru: Обрабатывается извне (внешней платежной системой)

source: iikoCloud for WooCommerce requires PHP 7.2 and high. Please, update you PHP version.
ru_ru: iikoCloud для WooCommerce требует PHP 7.2 и выше. Пожалуйста, обновите вашу версию PHP.

source: Every %d Minutes
ru_ru: Каждые %d Минуты
